package org.telran.lecture_02_big_o.practice;

// Задача: Проверить, является ли заданное число простым.

// Алгоритм:
// Проверить, делится ли число на 2. Если делится, то число не простое.
//     Пройти по всем нечетным числам от 3 до корня из числа.
//     Если число делится на какое-то из этих чисел, то оно не простое.
//     Если ни одно из чисел не является делителем, то число простое.

public class IsPrime {
    public static void main(String[] args) {

    }

    public static boolean isPrime(int number) {
        // You code ...
        return true;
    }
}


// Оценить сложность алгоритма