package org.telran.lecture_06_quick.tasks;

// "Призеры олимпиады"
// По результатам олимпиады участники награждаются дипломами.
// Набравшие одинаковые баллы получают дипломы одинаковой степени.
// Призером олимпиады считается участник, получивший диплом не хуже III степени.
// По результатам олимпиады определите количество призеров.
// Вход: массив из N натуральных чисел – результаты участников.
// Выход: одно число – число призеров.

// Пример:
// Вход
// 1 3 4 3 5 6 7 7 6 1
// Выход
// 5

// 1 3 4 3 5 6 7 7 6 1

// 7 7 6 6 5 4 3 3 1 1

public class Task03 {
    public static void main(String[] args) {
        Integer[] results = {1, 3, 4, 3, 5, 6, 7, 7, 6, 1};

    }
}
